<a href="https://colab.research.google.com/github/Elly0816/100-days-of-code/blob/main/College_Majors_vs_Earnings.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [32]:
import pandas as pd
from bs4 import BeautifulSoup
import requests

df = pd.read_csv('salaries_by_college_major.csv')

df.head()

     Undergraduate Major  ...     Group
0             Accounting  ...  Business
1  Aerospace Engineering  ...      STEM
2            Agriculture  ...  Business
3           Anthropology  ...      HASS
4           Architecture  ...  Business

[5 rows x 6 columns]

In [33]:
df.count()

Undergraduate Major                  51
Starting Median Salary               50
Mid-Career Median Salary             50
Mid-Career 10th Percentile Salary    50
Mid-Career 90th Percentile Salary    50
Group                                50
dtype: int64

In [34]:
df.shape

(51, 6)

In [35]:
df.columns

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

In [36]:
df.isna()

    Undergraduate Major  ...  Group
0                 False  ...  False
1                 False  ...  False
2                 False  ...  False
3                 False  ...  False
4                 False  ...  False
5                 False  ...  False
6                 False  ...  False
7                 False  ...  False
8                 False  ...  False
9                 False  ...  False
10                False  ...  False
11                False  ...  False
12                False  ...  False
13                False  ...  False
14                False  ...  False
15                False  ...  False
16                False  ...  False
17                False  ...  False
18                False  ...  False
19                False  ...  False
20                False  ...  False
21                False  ...  False
22                False  ...  False
23                False  ...  False
24                False  ...  False
25                False  ...  False
26                False  ...  False
27                False  ...  False
28                False  ...  False
29                False  ...  False
30                False  ...  False
31                False  ...  False
32                False  ...  False
33                False  ...  False
34                False  ...  False
35                False  ...  False
36                False  ...  False
37                False  ...  False
38                False  ...  False
39                False  ...  False
40                False  ...  False
41                False  ...  False
42                False  ...  False
43                False  ...  False
44                False  ...  False
45                False  ...  False
46                False  ...  False
47                False  ...  False
48                False  ...  False
49                False  ...  False
50                False  ...   True

[51 rows x 6 columns]

In [37]:
df.tail()

      Undergraduate Major  ...  Group
46             Psychology  ...   HASS
47               Religion  ...   HASS
48              Sociology  ...   HASS
49                Spanish  ...   HASS
50  Source: PayScale Inc.  ...    NaN

[5 rows x 6 columns]

In [38]:
clean_df = df.dropna()

In [39]:
clean_df.tail()

   Undergraduate Major  ...  Group
45   Political Science  ...   HASS
46          Psychology  ...   HASS
47            Religion  ...   HASS
48           Sociology  ...   HASS
49             Spanish  ...   HASS

[5 rows x 6 columns]

In [40]:
max_median_salary = clean_df['Starting Median Salary'].idxmax()

In [41]:
clean_df['Undergraduate Major'][max_median_salary]

'Physician Assistant'

In [42]:
clean_df.columns

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

In [43]:
mid_carrer_salary = clean_df['Mid-Career Median Salary'].idxmax()

In [44]:
print(f"The major with the highest mid carrer salary is {clean_df['Undergraduate Major'][mid_carrer_salary]} with a salary of ${clean_df['Mid-Career Median Salary'][mid_carrer_salary]}")

The major with the highest mid carrer salary is Chemical Engineering with a salary of $107000.0

In [45]:
min_starting_salary = clean_df['Starting Median Salary'].idxmin()

In [46]:
print(f"The major with the lowest starting median salary is {clean_df['Undergraduate Major'][min_starting_salary]} with earnings at ${clean_df['Starting Median Salary'][min_starting_salary]}")

The major with the lowest starting median salary is Spanish with earnings at $34000.0

In [47]:
min_mid_career = clean_df['Mid-Career Median Salary'].idxmin()

In [48]:
print(f"The major with the lowest mid carrer earning is {clean_df['Undergraduate Major'][min_mid_career]} with earnings of ${clean_df['Mid-Career Median Salary'][min_mid_career]}")

The major with the lowest mid carrer earning is Education with earnings of $52000.0

In [49]:
spread = clean_df['Mid-Career 90th Percentile Salary'].subtract(clean_df['Mid-Career 10th Percentile Salary'])

In [50]:
clean_df.insert(1, 'Spread', spread)

In [51]:
max_spread = clean_df['Spread'].idxmax()

In [52]:
clean_df['Undergraduate Major'][max_spread]

'Economics'

In [53]:
low_risk = clean_df.sort_values('Spread')
low_risk[['Undergraduate Major', 'Spread']].head()

           Undergraduate Major    Spread
40                     Nursing 50,700.00
43         Physician Assistant 57,600.00
41                   Nutrition 65,300.00
49                     Spanish 65,400.00
27  Health Care Administration 66,400.00

In [54]:
low_risk[["Undergraduate Major", "Spread"]].tail()

   Undergraduate Major     Spread
42          Philosophy 132,500.00
36           Marketing 132,900.00
37                Math 137,800.00
22             Finance 147,800.00
17           Economics 159,400.00

In [55]:
clean_df.columns

Index(['Undergraduate Major', 'Spread', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

Majors with the highest Potential

In [56]:
highest_potential = clean_df.sort_values('Mid-Career 90th Percentile Salary', ascending=False)
highest_potential[['Undergraduate Major', 'Mid-Career 90th Percentile Salary']].head()

     Undergraduate Major  Mid-Career 90th Percentile Salary
17             Economics                         210,000.00
22               Finance                         195,000.00
8   Chemical Engineering                         194,000.00
37                  Math                         183,000.00
44               Physics                         178,000.00

Majors with the greatest spread in mid career earnings

In [57]:
greatest_spread = clean_df.sort_values('Spread', ascending=False)
greatest_spread[['Undergraduate Major', 'Spread']].head()

   Undergraduate Major     Spread
17           Economics 159,400.00
22             Finance 147,800.00
37                Math 137,800.00
36           Marketing 132,900.00
42          Philosophy 132,500.00

Majors with the highest mid-career median earnings

In [58]:
highest_mid_career_earnings = clean_df.sort_values('Mid-Career Median Salary', ascending=False)
highest_mid_career_earnings[['Undergraduate Major', 'Mid-Career Median Salary']].head()

       Undergraduate Major  Mid-Career Median Salary
8     Chemical Engineering                107,000.00
12    Computer Engineering                105,000.00
19  Electrical Engineering                103,000.00
1    Aerospace Engineering                101,000.00
17               Economics                 98,600.00

In [59]:
pd.options.display.float_format = '{:,.2f}'.format
clean_df.groupby('Group').mean()

             Spread  ...  Mid-Career 90th Percentile Salary
Group                ...
Business 103,958.33  ...                         147,525.00
HASS      95,218.18  ...                         129,363.64
STEM     101,600.00  ...                         157,625.00

[3 rows x 5 columns]

In [117]:
URL = 'https://www.payscale.com/college-salary-report/majors-that-pay-you-back/bachelors'


# 35
records = []
for page in range(1, 35):
    response = requests.get(f'{URL}/page/{page}')
    soup = BeautifulSoup(response.text, 'html.parser')
    # Get the names of the columns
    columns = [name.text.replace(':', '') for name in soup.find_all(class_='data-table__title')]
    columns = columns[0:6]
    # Get the values from each row in the table
    rows = [row.find_all(class_='data-table__value') for row in soup.tbody.find_all('tr')]
    for row in rows:
        record = {columns[0]: row[0].text,
                  columns[1]: row[1].text,
                  columns[2]: row[2].text,
                  columns[3]: float(row[3].text.replace('$', '').replace(',', '')),
                  columns[4]: float(row[4].text.replace('$', '').replace(',', '')),
                  columns[5]: row[5].text}
        records.append(record)

# Convert the records to a dataframe
new_df = pd.DataFrame(records)

In [118]:
new_df.shape

(827, 6)

In [119]:
new_df.columns

Index(['Rank', 'Major', 'Degree Type', 'Early Career Pay', 'Mid-Career Pay',
       '% High Meaning'],
      dtype='object')

In [120]:
new_df.head()

  Rank  ... % High Meaning
0    1  ...            67%
1    2  ...            28%
2    3  ...            46%
3    4  ...            55%
4    5  ...            47%

[5 rows x 6 columns]

In [121]:
new_df = new_df[['Major', 'Early Career Pay', 'Mid-Career Pay']]

In [122]:
new_df.sort_values('Mid-Career Pay', ascending=False).head()

                                              Major  ...  Mid-Career Pay
0                             Petroleum Engineering  ...      187,300.00
1      Operations Research & Industrial Engineering  ...      170,400.00
2  Electrical Engineering & Computer Science (EECS)  ...      159,300.00
3                                Interaction Design  ...      155,800.00
4                                 Public Accounting  ...      147,700.00

[5 rows x 3 columns]

In [133]:
new_df.sort_values('Early Career Pay', ascending=False)[['Major', 'Early Career Pay']].head()

                                                Major  Early Career Pay
2    Electrical Engineering & Computer Science (EECS)        108,500.00
75                        Physician Assistant Studies         95,900.00
0                               Petroleum Engineering         93,200.00
1        Operations Research & Industrial Engineering         84,800.00
158              Nuclear Engineering Technology (NET)         83,500.00

In [135]:
new_df.sort_values('Mid-Career Pay', ascending=False)[['Major', 'Mid-Career Pay']].head()

                                              Major  Mid-Career Pay
0                             Petroleum Engineering      187,300.00
1      Operations Research & Industrial Engineering      170,400.00
2  Electrical Engineering & Computer Science (EECS)      159,300.00
3                                Interaction Design      155,800.00
4                                 Public Accounting      147,700.00

In [125]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 827 entries, 0 to 826
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Major             827 non-null    object
 1   Early Career Pay  827 non-null    float64
 2   Mid-Career Pay    827 non-null    float64
dtypes: float64(2), object(1)
memory usage: 19.5+ KB

In [128]:
new_df['Early Career Pay'].max()

108500.0

In [140]:
new_df.isna().sum()

Major               0
Early Career Pay    0
Mid-Career Pay      0
dtype: int64